In [27]:
import pandas as pd

d_list = ['준석','정현','주현']
v_list = [10,20,30]

sr = pd.Series(v_list, index= d_list)

df = sr.rename_axis('name').reset_index(name='age')

df

  name  age
0   준석   10
1   정현   20
2   주현   30

In [41]:
sr.duplicated().sum()

np.int64(0)

In [54]:
a = df.loc[:,'age':'age']

print(a)

   age
0   10
1   20
2   30

0    준석
1    정현
2    주현
Name: name, dtype: object

In [67]:
import pandas as pd

data = {'Category': ['A', 'A', 'B', 'B', 'A', 'C'],
        'Value': [10, 15, 20, 25, 12, 30]}
df = pd.DataFrame(data)

# group_keys=True (기본값)
grouped_true = df.groupby('Category').sum()
print("group_keys=True:\n", grouped_true)
# Category가 인덱스로 포함됨

# group_keys=False
grouped_false = df.groupby('Category', group_keys=False).sum()
print("\ngroup_keys=False:\n", grouped_false)
# Category가 인덱스로 포함되지 않고 열로 유지됨 (as_index=False와 유사하게 동작)

grouped_true
grouped_false

group_keys=True:
           Value
Category
A            37
B            45
C            30

group_keys=False:
           Value
Category
A            37
B            45
C            30

          Value
Category
A            37
B            45
C            30